# -*- coding: utf-8 -*-
"""
Created on Sat Sep  1 22:17:59 2018

@author: User
"""

#Завдання 2 . Написати програму, що виводить ‘hello world’.

print('hello, world')


#Завдання 3. Написати функцію, що приймає два параметри: два додатні
#числа, а повертає boolean значення чи перше число ділиться на друге без остачі.
#Передбачити вивід помилки (Exception), коли введено хоча б одне від’ємне
#число

def div(a,b):
    
   

    if a % b == 0:
        return True
    return False




#Завдання 4. Використовуючи функцію із попереднього завдання створити
#нову функцію, яка приймає два параметри – два числа, та повертає масив
#простих чисел у цьому відрізку або видає помилку ‘NoSimpleDigits’, коли таких
#немає.
def primal(st,en):
    primal_numbers = []
    for x in range(st,en):
        for n in range(2,x):
            if x % n == 0:
                break;
        else:
            primal_numbers.append(x)
    if len(primal_numbers)==0:
        raise Exception('NoSimpleDigits')
    return primal_numbers
           
a = int(input('Введіть перше число:'))
b = int(input('Введіть друге число:'))
if a<0 or b<0: 
    raise Exception('Ви ввели від\'ємне число')
print ('Масив простих чисел у межах від', a, 'до', b, ' ', primal(a,b))




#Завдання 5. Дано масив
#['a', ['c', 1, 3], ['f', 7, [4, '4']], [{'lalala': 111}]]
#Написати програму, яка перетворить заданий масив з кількома рівнями
#вкладеності (масив з неоднотипними елементами) в масив з одним рівнем
#вкладеності. Тобто програма має вивести масив, з такими елементами:
#['a', 'c', 1, 3, 'f', 7, 4, '4', {'lalala': 111}]
#При написанні програми передбачити можливість введення іншого
#масиву з іншими даними в якості контрольного прикладу для перевірки
#коректності роботи розробленого алгоритму.


input_list = ['a', ['c', 1, 3], ['f', 7, [4, '4']], [{'lalala': 111}]] 
output_list = []
for i in range(len(input_list)):
    output_list+=input_list[i]
        
print(output_list)